<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Sub Queries Questions</h1>

In [4]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/mydb

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%%sql
SELECT * FROM olympic
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(0, 1, 'A Dijiang', 'M', 24.0, 180.0, 80.0, 'CHN', 1992, 'Basketball', "Basketball Men's Basketball", None, 'China'),
 (1, 2, 'A Lamusi', 'M', 23.0, 170.0, 60.0, 'CHN', 2012, 'Judo', "Judo Men's Extra-Lightweight", None, 'China'),
 (2, 602, 'Abudoureheman', 'M', 22.0, 182.0, 75.0, 'CHN', 2000, 'Boxing', "Boxing Men's Middleweight", None, 'China')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
    Display the names of athletes who won a gold medal in the 2008 Olympics and whose height is greater than the average height of all athletes in the 2008 Olympics.
</div>

In [55]:
%%sql
SELECT Name FROM olympic WHERE 

Medal = "Gold" AND
year = 2008 AND 
Height IS NOT NULL AND 
Height > (SELECT AVG(height) FROM olympic WHERE year = 2008 AND Height IS NOT NULL)

LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('Jin Ziwei',),
 ('Lin Dan',),
 ('Liu Zige',),
 ('Meng Guanliang',),
 ('Pang Wei',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Display the names of athletes who won a medal in the sport of basketball in the 2016 Olympics and whose weight is less than the average weight of all athletes who won a medal in the 2016 Olympics.
</div>

In [54]:
%%sql
SELECT Name FROM olympic WHERE 
Sport = "Basketball" 
AND Year = 2016
AND Medal IS NOT NULL 
AND Weight < (SELECT AVG(Weight) FROM olympic WHERE Year = 2016 AND Medal IS NOT NULL)
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('Anna Cruz Lebrato',),
 ('Slvia Domnguez Fernndez',),
 ('Astou Barro Ndour Gueye',),
 ('Laia Palau Alts',),
 ('Leonor Rodrguez Manso',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Display the names of all athletes who have won a medal in the sport of swimming in both the 2008 and 2016 Olympics.
</div>

In [61]:
%%sql
SELECT Name FROM olympic WHERE Medal IS NOT NULL AND Sport = "Swimming" AND Year IN (2008,2016)
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('Fu Yuanhui',),
 ('Jiao Liuyang',),
 ('Liu Zige',),
 ('Pang Jiaying',),
 ('Pang Jiaying',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Display the names of all countries that have won more than 50 medals in a single year
</div>

In [81]:
%%sql
SELECT country,Year, COUNT(*) FROM olympic 
WHERE Medal IS NOT NULL 
AND country IS NOT NULL
GROUP BY country,Year HAVING COUNT(*) > 50
ORDER BY Year,country
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('France', 1900, 225),
 ('UK', 1900, 107),
 ('USA', 1900, 63),
 ('USA', 1904, 394),
 ('Canada', 1908, 52)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Display the names of all athletes who have won medals in more than one sport in the same year
</div>

In [111]:
%%sql

SELECT DISTINCT Name FROM olympic 
WHERE ID IN 
            (   SELECT DISTINCT ID FROM olympic 
                WHERE Medal IS NOT NULL 
                GROUP BY ID,Sport,Year 
                HAVING COUNT(Medal) > 1
                ORDER BY COUNT(Medal) DESC
            ) 

LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('Cao Yuan',),
 ('Chen Aisen',),
 ('Chen Jing',),
 ('Chen Ruolin',),
 ('Chen Yibing',),
 ('Cheng Fei',),
 ('Deng Yaping',),
 ('Ding Ning',),
 ('Du Li',),
 ('Fan Bin',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
What is the average weight difference between male and female athletes in the Olympics who have won a medal in the same event?
</div>

In [309]:
%%time
%%sql
SELECT AVG(m.Weight - f.Weight) FROM (SELECT * FROM olympic WHERE Sex = 'M' AND Medal is NOT NULL) m
JOIN (SELECT * FROM olympic WHERE Sex = "F" AND Medal is NOT NULL) f ON m.Event = f.Event

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.
CPU times: user 6.8 ms, sys: 237 µs, total: 7.03 ms
Wall time: 25.6 s

[(12.602344622255304,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
How many patients have claimed more than the average claim amount for patients who are smokers and have at least one child,and belong to the southeast region?
</div>

In [183]:
%%sql
SELECT * FROM health_ins
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(0, 1, 39.0, 'male', 23.2, 91, 'Yes', 0, 'No', 'southeast', 1121.87),
 (1, 2, 24.0, 'male', 30.1, 87, 'No', 0, 'No', 'southeast', 1131.51),
 (2, 3, None, 'male', 33.3, 82, 'Yes', 0, 'No', 'southeast', 1135.94)]

In [207]:
%%sql
SELECT COUNT(claim) FROM health_ins WHERE claim > ( 
    SELECT AVG(claim) FROM health_ins 
        WHERE smoker = 'Yes' 
        AND region = 'southeast' 
        AND children >= 1 )

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(141,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
How many patients have claimed more than the average claim amount
for patients who are not smokers and have a BMI greater than the
average BMI for patients who have at least one child?
</div>

In [243]:
%%sql

SELECT COUNT(claim) FROM health_ins 
WHERE claim > (
                        SELECT AVG(claim) FROM health_ins 
                        WHERE smoker = 'No' 
                        AND 
                        bmi > (SELECT AVG(bmi) FROM health_ins WHERE children >= 1)
                )

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(698,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
How many patients have claimed more than the average claim amount
for patients who have a BMI greater than the average BMI for patients
who are diabetic, have at least one child, and are from the
southwest region?
</div>

In [242]:
%%sql

SELECT COUNT(claim) FROM health_ins 
            WHERE claim >
            (
                
             SELECT AVG(claim) FROM health_ins 
             WHERE bmi > (
                    SELECT AVG(bmi) FROM health_ins
                                WHERE children >= 1 AND region = "southwest" AND diabetic = "Yes"
                         )
            )

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(349,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
What is the difference in the average claim amount between patients who are smokers and patients who are non-smokers, and have the same BMI and number of children
</div>

In [244]:
%%sql
SELECT * FROM health_ins
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(0, 1, 39.0, 'male', 23.2, 91, 'Yes', 0, 'No', 'southeast', 1121.87)]

In [305]:
%%sql
SELECT AVG(t1.claim-t2.claim) FROM health_ins t1
INNER JOIN health_ins t2
ON 
t1.bmi = t2.bmi AND t1.children = t2.children AND t1.smoker != t2.smoker

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(-2.3572617780645283e-12,)]